int[] arr = new int[5]; //Создает массив arr размером 5
arr[0] = 5; //заполняет его следующими значениями: 5
arr[1] = 7; //заполняет его следующими значениями: 7
arr[2] = 5; //заполняет его следующими значениями: 5
arr[3] = 4; //заполняет его следующими значениями: 4
arr[4] = 3; //заполняет его следующими значениями: 3
Console.WriteLine(arr[0]);//выводит значения в консоль 0 это первое значение
Console.WriteLine(arr[1]);//выводит значения в консоль 1 это второе значение
Console.WriteLine(arr[2]);//выводит значения в консоль 2 это третье значение
Console.WriteLine(arr[3]);//выводит значения в консоль 3 это четвертое значение
Console.WriteLine(arr[4]);//выводит значения в консоль 4 это пятое значение

//Console.WriteLine(arr[5]);

int[] arr2 = new int[5] { 1, 2, 3, 4, 5 };//Массив arr2 создается и инициализируется при создании с пятью значениями.

int[] arr3 = { 1, 2, 3, 4, 5 };//ассив arr3 создается и инициализируется с помощью значения элементов

// in python   arr = [1,2,3,4,5]
